Repository: marcio704/learn_django
Catalog: locale/*/LC_MESSAGES/django.po
Languages: pt_br

source: Username
pt_br: Login

source: Name
pt_br: Nome

source: Password
pt_br: Senha

source: This username is already in use, please choose another one
pt_br: Este nome de usuário já está em uso. Por favor, escolha outro

source: This e-mail is already in use, please choose another one
pt_br: Este e-mail de usuário já está em uso. Por favor, escolha outro

source: Easy Django, step by step!
pt_br: Easy Django, passo a passo!

source: Passion for web, python and simplicity
pt_br: Paixão por web, python e simplicidade

source: This is us!
pt_br: <p>Este blog foi inteiramente desenvolvido em Django para que possa servir de ferramenta de inspiração e de aprendizado àqueles que desejam aprender mais sobre Python e Django.</p> <p>A ideia deste site é mostrar e ensinar, passo a passo, como construir uma aplicação web em Django que utilize os principais conceitos e paradigmas enfrentados por qualquer desenvolvedor web. Durante o processo de escrita dos posts, serão abordados assuntos comuns mas essenciais para quem deseja desenvolver uma aplicação web de maneira rápida e simples utilizando o Django Framework.</p> <p> Por isso, post a post, mostrarei como construi este blog que, apesar de simples, fez uso dos principais tópicos e recursos já nativos (em sua maioria) do Django e que qualquer aplicação web, independentemente de sua complexidade ou domínio, também fará uso constante como, por exemplo:</p> <ul><li>Sistema de autenticação (login/ logout).</li> <li>Persistência em banco de dados utilizando o ORM (Mapeamento objeto-relacional) do Django.</li> <li>Como utilizar o sistema de admin do Django para manipular e editar seus registros (CRUD).</li> <li>Sistema de migrations do Django para rastrear mundanças em suas entidades e no seu Banco de Dados</li> <li> Como manipular transações em banco de dados </li><li>Construção e hierarquia de templates HTML.</li> <li>Construção de templates com HTML dinâmico (tags).</li> <li>Manipulação de arquivos estáticos (CSS, JS, arquivos de imagem)</li> <li>Envio e manipulação de formulários via POST e GET.</li> <li>Paginação (backend e frontend)</li> <li>Ajax com Django</li> <li>Como mapear suas rotas (URLs) no Django</li> <li>Internacionalização (Sistema Multilingue) </li> <li> Criação e agendamento de Jobs (cron scheduling) </li> <li> Envio de e-mail via SMTP </li> <li>Criação e execução de Testes Unitários</li> <ul>

source: Get in touch :)
pt_br: Entre em contato :)

source: It's fast and easy, just like Django!
pt_br: É rápido e fácil, assim como o Django!

source: Fill the informations below, we'll answer as fast as we can:
pt_br: Preencha as informações abaixo, responderemos o quanto antes:

source: Email Address
pt_br: Email

source: Message
pt_br: Mensagem

source: Send
pt_br: Enviar

source: Welcome to
pt_br: Bem-vindo ao

source: See our last posts
pt_br: Veja os posts mais recentes sobre Django em português

source: This post was written by:
pt_br: Esse post foi escrito por:

source: Read More
pt_br: Leia Mais

source: No posts available.
pt_br: Nenhum post disponível

source: Newer posts
pt_br: Anterior

source: Older posts
pt_br: Próximo

source: These are all posts we've written so far. Enjoy!
pt_br: Estes são todos os posts que escrevemos até agora. Divirta-se!

source: From:
pt_br: De:

source: Newer
pt_br: Próximo

source: Older
pt_br: Anterior

source: No posts found yet :(
pt_br: Nenhum post encontrado :(

source: written by:
pt_br: escrito por

source: Posted on:
pt_br: Postado em:

source: Leave a Comment:
pt_br: Deixe um comentário

source: Send:
pt_br: Enviar

source: Return to home page
pt_br: Retornar à página principal

source: Posts about
pt_br: Posts sobre

source: No posts found for this category :(
pt_br: Nenhum post encontrado para esta categoria :(

source: This token does not exist or was already used.
pt_br: Este token não existe ou já foi utilizado

source: Your account has been successfully confirmed =)
pt_br: Sua conta foi confirmada com sucesso =)

source: Forgot my password
pt_br: Esqueci minha senha

source: Please enter your email address
pt_br: Por favor, digite seu e-mail

source: Please enter your login.
pt_br: Por favor, digite seu login.

source: Please enter your password.
pt_br: Por favor, digite sua senha.

source: Go, go, go!
pt_br: Aproveite!

source: Forgot your password?
pt_br: Esqueceu sua senha?

source: Not signed yet?
pt_br: Ainda não é cadastrado?

source: Rescue my password
pt_br: Esqueci minha senha

source: Please enter your new password
pt_br: Por favor, digite sua nova senha

source: Again
pt_br: Novamente

source: Please enter your new password again
pt_br: Por favor, digite novamente sua senha.

source: Fill the informations below:
pt_br: Preencha as informações abaixo:

source: Confirm Password
pt_br: Confirme sua senha

source: Choose a picture
pt_br: Escolha uma foto

source: There were some errors in the information you entered. Please correct the following:
pt_br: Há erros nas informações preenchidas. Por favor, corrija o seguinte:

source: Blog Search
pt_br: Procurar

source: Blog Categories
pt_br: Categorias

source: Related Contents
pt_br: Conteúdos Relacionados

source: Python Official Website
pt_br: Site Oficial do Python

source: Django Official Website
pt_br: Site Oficial do Django

source: About
pt_br: Sobre

source: All Posts
pt_br: Todos os posts

source: Contact
pt_br: Contato

source: (Log in)
pt_br: (Entrar)

source: (Log out)
pt_br: (Sair)

source: Hi, did you forget your EasyDjango password? Click the link below to rescue your password:
pt_br: Esqueceu sua senha do LearDjango? Clique no link abaixo, para recuperá-la:

source: Confirmation token not found for this user
pt_br: Token de confirmação não encontrado para este usuário

source: User not confirmed yet, get the confirmation link at your e-mail!
pt_br: Este usuário ainda não foi confirmado, clique no link de confirmação no seu e-mail!

source: User/password not found!
pt_br: Usuário/senha não encontrados!

source: Sorry, an error occurred while creating your user. Try again later.
pt_br: Desculpe, ocorreu um erro ao criar seu usuário, tente novamente mais tarde.

source: Wrong password confirmation
pt_br: Confimarção de senha incorreta

source: Hi, just click the link below in order to confirm your EasyDjango account:
pt_br: Olá, clique no link abaixo para confirmar sua conta no EasyDjago:

source: Your account has been created, please go to your e-mail to confirm it.
pt_br: Sua conta foi criada, por favor, faça a confirmação no seu email.
