Repository: marcio704/learn_django
Catalog: locale/*/LC_MESSAGES/djangojs.po
Languages: pt_br

source: Your message has been sent
pt_br: E-mail enviado com sucesso

source: Sorry
pt_br: Desculpe

source: , it seems that our server is not responding. Please try again later!
pt_br: , parece que nosso servidor não está respondendo no momento. Por favor, tente mais tarde!

source: Your user has been successfully created.
pt_br: Usuário criado com sucesso.

source: This username is already in use, please choose another one
pt_br: Login já em uso, por favor, escolha outro

source: This e-mail is already in use, please choose another one
pt_br: E-mail já em uso, por favor, digite outro

source: Wrong password confirmation
pt_br: Confirmação de senha está diferente

source: Email has been sent!
pt_br: E-mail enviado com sucesso

source: Sorry, it seems that our server is not responding. Please try again later!
pt_br: Desculpe, parece que nosso servidor não está respondendo no momento. Por favor, tente mais tarde!

source: Cannot find an user with this email address
pt_br: Não foi encontrado nenhum usuário cadastrado com este e-mail

source: Invalid email
pt_br: E-mail inválido

source: Your password has been successfully changed!
pt_br: Senha alterada com sucesso.

source: There are informations missing, you can not change your password
pt_br: Há informações faltando, você não poderá mudar sua senha

source: Password confirmation is wrong
pt_br: Confirmação de senha está diferente
